# NotALineRiserRampError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..NotALineRiserRampError Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Riser line must be a straight line for Ramps.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NotALineRiserRampError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NotALineRiserRampError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NotALineRiserRampError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace